{
    "What is your name?":
        "My name is Parsa's Chatbot.",
    
    "What can you do?":
        "I can answer Minecrafty questions, provide information, and help you with tasks.",

    "What is the capital of France?":
        "The capital of France is Paris.",

    "What is the population of China?":
        "The population of China is 1.4 billion people.",

      "Who wrote the book 'To Kill a Mockingbird'?":
        "Harper Lee wrote the book 'To Kill a Mockingbird'.",

    "What year did World War II end?":
        "World War II ended in 1945.",

    "Who invented the telephone?":
        "Alexander Graham Bell invented the telephone in 1876.",

    "How many states are there in the United States?":
        "There are 50 states in the United States.",

    "What is the largest ocean on Earth?":
        "The Pacific Ocean is the largest ocean on Earth.",

    "Who was the first president of the United States?":
        "George Washington was the first president of the United States.",
    "tellraw example":
        "Example for someone joined to game:\n/tellraw @a {\"text\":\"ParsaGP joined the game\",\"color\":\"yellow\"}",

    "zoom mods":
        "OptiFine https://optifine.net/, \nZoomify: https://www.curseforge.com/minecraft/mc-mods/zoomify/, \nWI Zoom: https://www.curseforge.com/minecraft/mc-mods/wi-zoom, \nOkZoomer: https://www.curseforge.com/minecraft/mc-mods/ok-zoomer",

    "optimization mods":
        "Forge: Optifine,\n Modpack: OpalFab, Fabolusly Optimized",

    "java version":
        "The Java version can be found in the Java Control Panel. Under the General tab in the Java Control Panel, the version is available through the About section. A dialog appears (after clicking About) showing the Java version.",

    "buy a original minecraft account":
        "You can get a legal minecraft account in many ways:\n 1. From minecraft.net with a paypal account; But your PayPal account may be disabled. Because PayPal can identify you as Iranian due to your IP not being the same or any other reason. Keep in mind that you need a virtual number to create a PayPal account. Also, buy from a reliable store and we do not take responsibility for account theft or account\n 2. From a reliable shop; I would like to introduce you to onlinekeys.ir. I have bought from there myself, but as before, we do not take any responsibility for theft or fraud.",

    "limit ram in minecraft launcher":
        "Go to the installation section\nThen you hover over the version you want to change the RAM\nThere are three points you click\nThen you go to advanced settings\nThen you set the value of -Xmx800M to the value you want\nFor example\nOne Gigabyte: -Xmx1G\nOne gigabyte and a half: Xmx1536M\nHalf gigabyte: -Xmx512M",

    "give barrier":
        "/give @s minecraft:barrier",
        
    "crack skin":
        "There is a mod called CustomSkinLoader, it is both forged and fabric\nYou and your friend put it in the mods folder, then you go to your skin in the config files, you set it, your friend sets it, and you both see the same skin.",
        
    "i have a premium account but my friend don't. skin problem":
        "- Look, you have an account, but you can't see his skin because your friend hasn't bought the game and his skin is not registered in Minecraft servers. So his skin will not be shown to you\nBut your friend who hates you has two problems\n1. Use TLauncher: TLauncher itself (unfortunately) comes and manipulates Minecraft files and does something so that those who use TLauncher, instead of using the Minecraft server, use the TLauncher server to load skins and because you use TLauncher You are not (or you are using another launcher), the skin is not in the launcher server, and as a result, the skin is not loaded in any way.\n2. Use other launchers such as multimc so that the minecraft file is exactly the official and unmodified minecraft file (and it is open source, because if it is not, it is possible that the files have been manipulated): because the minecraft file is not manipulated and the game is played from the server. He uses minecraft to load the skin, your skin goes to him, but because his skin is not in the minecraft servers, he cannot see his own skin.",
        
    "what is minecon":
        "Minecon is an annual interactive livestream and fan convention about the video game Minecraft, hosted by Mojang. The first gathering in 2010 was known as MinecraftCon. The event then went by the Minecon name from 2011 to 2019. (Source: Wikipedia, obviously)",
        
    "what is the difference between full access and original premium account?":
        "Original and Full Access are not so different from each other, but since the account belongs to another person, Full Access is unlikely to be used."
}